In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('heights.csv')

In [3]:
df.head(25)

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

In [4]:
df.describe()

          height
count  20.000000
mean    8.390000
std     8.782812
min     1.200000
25%     5.350000
50%     5.700000
75%     6.275000
max    40.200000

In [13]:
df.columns

Index(['name', 'height'], dtype='object')

In [14]:
Q1=df.height.quantile(0.25)

In [15]:
Q1

5.3500000000000005

In [17]:
Q3=df.height.quantile(0.75)

In [18]:
Q3

6.275

In [19]:
lower_bound=Q1-1.5*(Q3-Q1)
lower_bound

3.962500000000001

In [21]:
upper_bound=Q3+1.5*(Q3-Q1)
upper_bound

7.6625

In [29]:
df1=df[(df.height >lower_bound) & (df.height < upper_bound)]

In [30]:
df1

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1

In [34]:
df1.shape

(15, 2)

In [35]:
df1.describe()

         height
count  15.00000
mean    5.76000
std     0.56921
min     4.90000
25%     5.45000
50%     5.60000
75%     6.05000
max     7.10000

In [36]:
df2=pd.read_csv('weight-height.csv')

In [39]:
df2.head(11)

   Gender     Height      Weight
0    Male  73.847017  241.893563
1    Male  68.781904  162.310473
2    Male  74.110105  212.740856
3    Male  71.730978  220.042470
4    Male  69.881796  206.349801
5    Male  67.253016  152.212156
6    Male  68.785081  183.927889
7    Male  68.348516  167.971110
8    Male  67.018950  175.929440
9    Male  63.456494  156.399676
10   Male  71.195382  186.604926

In [41]:
df2.shape

(10000, 3)

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699